configuration/src/Catalogs/ReportMailings/ReportMailings.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ReportMailings</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>PersonalMailings</name>
      <description>Personal mailing lists</description>
    </items>
  </predefined>
  <attributes>
    <name>FTPDirectory</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FTPLogin</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FTPPassiveConnection</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>FTPPort</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>FTPServer</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>ReplyToAddress</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Archive</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>RecipientsEmailAddressKind</name>
    <type>
      <types>CatalogRef.ContactInformationKinds</types>
    </type>
  </attributes>
  <attributes>
    <name>ExecuteOnSchedule</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ArchiveName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>75</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>UseFTPResource</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UseFolder</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UseNetworkDirectory</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UseEmail</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>EmailPicturesInHTMLFormat</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Personal</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Folder</name>
    <type>
      <types>CatalogRef.FilesFolders</types>
    </type>
  </attributes>
  <attributes>
    <name>SchedulePeriodicity</name>
    <type>
      <types>EnumRef.ReportMailingSchedulePeriodicities</types>
    </type>
  </attributes>
  <attributes>
    <name>Personalized</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>HTMLFormatEmail</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>IsPrepared</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ScheduledJob</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>NetworkDirectoryLinux</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NetworkDirectoryWindows</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BCCs</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>EmailText</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>EmailTextInHTMLFormat</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>EmailSubject</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>MailingRecipientType</name>
    <type>
      <types>CatalogRef.ExtensionObjectIDs</types>
      <types>CatalogRef.MetadataObjectIDs</types>
    </type>
  </attributes>
  <attributes>
    <name>NotifyOnly</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TransliterateFileNames</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Account</name>
    <type>
      <types>CatalogRef.EmailAccounts</types>
    </type>
  </attributes>
  <attributes>
    <name>DeleteIncludeDateInFileName</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>EmailImportance</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ShouldInsertReportsIntoEmailBody</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ShouldAttachReports</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ShouldSetPasswordsAndEncrypt</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Reports</name>
    <attributes>
      <name>Report</name>
      <type>
        <types>CatalogRef.AdditionalReportsAndDataProcessors</types>
        <types>CatalogRef.ReportsOptions</types>
      </type>
    </attributes>
    <attributes>
      <name>SendIfEmpty</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Settings</name>
      <comment>Custom set-up of data components or value Tables</comment>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>DescriptionTemplate1</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ReportFormats</name>
    <attributes>
      <name>Report</name>
      <type>
        <types>CatalogRef.AdditionalReportsAndDataProcessors</types>
        <types>CatalogRef.ReportsOptions</types>
      </type>
    </attributes>
    <attributes>
      <name>Format</name>
      <type>
        <types>EnumRef.ReportSaveFormats</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Recipients</name>
    <attributes>
      <name>Recipient</name>
      <type>
        <types>DefinedType.BulkEmailRecipient</types>
      </type>
    </attributes>
    <attributes>
      <name>Excluded</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/Enums/ContactInformationTypes/ContactInformationTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ContactInformationTypes</name>
  <enumValues>
    <name>Address</name>
  </enumValues>
  <enumValues>
    <name>Phone</name>
  </enumValues>
  <enumValues>
    <name>Email</name>
  </enumValues>
  <enumValues>
    <name>Skype</name>
  </enumValues>
  <enumValues>
    <name>WebPage</name>
  </enumValues>
  <enumValues>
    <name>Fax</name>
  </enumValues>
  <enumValues>
    <name>Other</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Catalogs/ReportMailings/Forms/PasswordDeliveryViaSMS/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, OOO 1C-Soft
// All rights reserved. This software and the related materials 
// are licensed under a Creative Commons Attribution 4.0 International license (CC BY 4.0).
// To view the license terms, follow the link:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////
//

#Region EventHandlersForm

&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	
	FilterSent = "All";
	MailingRecipientType = Parameters.MailingRecipientType;
	MailingDescription = Parameters.MailingDescription;
	MetadataObjectID = Parameters.MetadataObjectID;
	
	// ACC:1223-
	Items.DecorationHint.ToolTip = StringFunctionsClientServer.SubstituteParametersToString(
		NStr("en = 'A text message example: Your password: ******* to receive the ""%1"" report distribution.';"), MailingDescription);
	// 
	
	If Not IsTempStorageURL(Parameters.RecipientsAddress) Then
		Return;
	EndIf;
	
	Recipients.Load(GetFromTempStorage(Parameters.RecipientsAddress));

	DeleteFromTempStorage(Parameters.RecipientsAddress); 

	DefineRecipientsPhoneKind();
	PopulatePhoneNumbers();
	
	If Common.IsMobileClient() Then
		CommandBarLocation = FormCommandBarLabelLocation.Top;
		Items.Move(Items.Send, CommandBar); 
		Items.RecipientDescriptionAndPhone.Group = ColumnsGroup.Vertical; 
		Items.Close.Visible = False; 
		Items.Move(Items.Close, CommandBar);
	EndIf;

EndProcedure

#EndRegion

#Region FormHeaderItemsEventHandlers

&AtClient
Procedure TypeOfRecipientsPhoneOnChange(Item)
	PopulatePhoneNumbers();
EndProcedure

&AtClient
Procedure FilterSentOnChange(Item)
	SetFiltersInSMSDistributionResult();
EndProcedure

#EndRegion

#Region RecipientsFormTableItemEventHandlers

&AtClient
Procedure RecipientsSelection(Item, RowSelected, Field, StandardProcessing)

	Recipient = Items.Recipients.CurrentData.Recipient;

	If ValueIsFilled(Recipient) Then
		ShowValue( , Recipient);
	EndIf;

EndProcedure

&AtClient
Procedure RecipientsBeforeAddRow(Item, Cancel, Copy, Parent, IsFolder, Parameter)
	Cancel = True;
EndProcedure

&AtClient
Procedure RecipientsBeforeDeleteRow(Item, Cancel)
	Cancel = True;
EndProcedure

#EndRegion

#Region TableItemsEventHandlerOfSMSDistributionResultForm

&AtClient
Procedure SMSDistributionResultSelection(Item, RowSelected, Field, StandardProcessing)
	
	Recipient = Items.SMSDistributionResult.CurrentData.Recipient;

	If ValueIsFilled(Recipient) Then
		ShowValue( , Recipient);
	EndIf;
	
EndProcedure

#EndRegion

#Region FormCommandHandlers

&AtClient
Procedure Send(Command)
	Items.Send.Visible = False;
	Items.Pages.CurrentPage = Items.PageRuntimeState;
	
	SMSDistributionResult.Clear();
	PreparedSMSMessages = New Array;
	UnsentCount = 0;
	For Each RowRecipients In Recipients Do
		
		If Not ValueIsFilled(RowRecipients.ArchivePassword) Or Not ValueIsFilled(RowRecipients.Phone) Then

			ResultRow = SMSDistributionResult.Add();
			ResultRow.Recipient = RowRecipients.Recipient;
			ResultRow.NotSent = True;

			If Not ValueIsFilled(RowRecipients.ArchivePassword) Then
				ResultRow.Comment = NStr("en = 'A password is not set.';");
			EndIf;

			If Not ValueIsFilled(RowRecipients.Phone) Then
				ResultRow.Comment = ?(ValueIsFilled(ResultRow.Comment),
					ResultRow.Comment + Chars.LF + NStr("en = 'A phone number is not specified.';"), 
					NStr("en = 'A phone number is not specified.';"));
			EndIf;

			StringResultNoFilters = SMSDistributionResultNoFilters.Add();
			FillPropertyValues(StringResultNoFilters, ResultRow);
			UnsentCount = UnsentCount + 1;
			Continue;
		EndIf;
		
		PrepareSMS = New Structure("Recipient, SMSMessageText, PhoneNumbers");
		PrepareSMS.Recipient = RowRecipients.Recipient;
		// ACC:1223-
		PrepareSMS.SMSMessageText = StringFunctionsClientServer.SubstituteParametersToString(
		NStr("en = 'Your password: %1 to receive the ""%2"" report distribution.';"), RowRecipients.ArchivePassword,
		MailingDescription);
		// ACC:1223-
		PrepareSMS.PhoneNumbers = CommonClientServer.ValueInArray(RowRecipients.Phone);
		PreparedSMSMessages.Add(PrepareSMS);
		
	EndDo;
	
	StartupParameters = New Structure("PreparedSMSMessages, UnsentCount, Form");
	StartupParameters.PreparedSMSMessages = PreparedSMSMessages;
	StartupParameters.Form = ThisObject;
	StartupParameters.UnsentCount = UnsentCount;
	
	ReportMailingClient.SendBulkSMSMessages(StartupParameters);
	
EndProcedure

#EndRegion

#Region Private

&AtServer
Procedure SetFiltersInSMSDistributionResult()
	
	TableSMSDistributionResultNoFilters = FormAttributeToValue("SMSDistributionResultNoFilters");

	Builder = New QueryBuilder;
	Builder.DataSource = New DataSourceDescription(TableSMSDistributionResultNoFilters);

	Filter = Builder.Filter;

	Sent = Filter.Add("NotSent");
	Sent.ComparisonType	= ComparisonType.Equal;
	Sent.Value		= ?(FilterSent = "SentMessages", False, True);
	Sent.Use	= ?(FilterSent = "All", False, True);

	Builder.Execute();
	ResultTable1 = 	Builder.Result.Unload();

	ValueToFormAttribute(ResultTable1, "SMSDistributionResult");
	
EndProcedure

&AtServer
Procedure PopulatePhoneNumbers()
	
	RecipientsTable = FormAttributeToValue("Recipients");
	ArrayOfRecipients_ = RecipientsTable.UnloadColumn("Recipient");
	
	RecipientsWithPhoneNumbers = ContactsManager.ObjectsContactInformation(ArrayOfRecipients_,
		Enums.ContactInformationTypes.Phone, TypeOfRecipientsPhone);
	
	If RecipientsWithPhoneNumbers.Count() = 0 Then
		Return;
	EndIf;
	
	For Each BulkEmailRecipient In Recipients Do
		FilterParameters = New Structure("Object", BulkEmailRecipient.Recipient);
		FoundStringsWithPhoneNumbers = RecipientsWithPhoneNumbers.FindRows(FilterParameters);
		If FoundStringsWithPhoneNumbers.Count() > 0 Then
			BulkEmailRecipient.Phone = FoundStringsWithPhoneNumbers[0].Presentation;
		EndIf;
	EndDo;
	
EndProcedure

&AtServer
Procedure DefineRecipientsPhoneKind()
	
	RecipientsMetadata = Common.MetadataObjectByID(MetadataObjectID, False);
	CIGroupName = StrReplace(RecipientsMetadata.FullName(), ".", "");
	CIGroup = ContactsManager.ContactInformationKindByName(CIGroupName);
	
	Query = New Query;
	Query.Text = "SELECT TOP 1 Ref FROM Catalog.ContactInformationKinds WHERE Parent = &Parent AND Type = &Type";
	Query.SetParameter("Parent", CIGroup);
	Query.Parameters.Insert("Type", Enums.ContactInformationTypes.Phone);
	Selection = Query.Execute().Select();
	If Selection.Next() Then
		TypeOfRecipientsPhone = Selection.Ref;
	EndIf;
	
EndProcedure

#EndRegion
